rjackson-clconsulting/m8178106P/Src/os/ports/GCC/ARMCMx/MB9BF5xx/mb9bd1xt.h
/**
@file		mb9bd1xt.h
@brief		header File to add some structure and define for peripheral device of MF3
@author		Fernando Morani
@date		12/12/2016
@version	00.00
@source     M75-CPU Controller
*/

/**
* This File has the same name of the one downloaded from Fujitsu Site.
* This is an extract of that file in order to fill the missing declaration
* in mb9md10t.h file avoiding duplicates.
**/

#ifndef _MB9BD1XT_H_
#define _MB9BD1XT_H_

#define FM3_MFT0_BASE                             (0x40020000UL) /* MFT0 Base Address */
#define FM3_MFT1_BASE                             (0x40021000UL) /* MFT1 Base Address */
#define FM3_MFT2_BASE                             (0x40022000UL) /* MFT2 Base Address */

#define FM3_MFT0                                  ((FM_MFT_TypeDef *)FM3_MFT0_BASE)
#define FM3_MFT1                                  ((FM_MFT_TypeDef *)FM3_MFT1_BASE)
#define FM3_MFT2                                  ((FM_MFT_TypeDef *)FM3_MFT2_BASE)


/******************************************************************************
 ** MFT_MODULE
 **
 ******************************************************************************/
typedef struct stc_mft_ocsa10_field
{
        __IO   uint8_t  CST0                     :1;
        __IO   uint8_t  CST1                     :1;
        __IO   uint8_t  BDIS0                    :1;
        __IO   uint8_t  BDIS1                    :1;
        __IO   uint8_t  IOE0                     :1;
        __IO   uint8_t  IOE1                     :1;
        __IO   uint8_t  IOP0                     :1;
        __IO   uint8_t  IOP1                     :1;
} stc_mft_ocsa10_field_t;

typedef struct stc_mft_ocsb10_field
{
        __IO   uint8_t  OTD0                     :1;
        __IO   uint8_t  OTD1                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  BTS0                     :1;
        __IO   uint8_t  BTS1                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_ocsb10_field_t;

typedef struct stc_mft_ocsa32_field
{
        __IO   uint8_t  CST2                     :1;
        __IO   uint8_t  CST3                     :1;
        __IO   uint8_t  BDIS2                    :1;
        __IO   uint8_t  BDIS3                    :1;
        __IO   uint8_t  IOE2                     :1;
        __IO   uint8_t  IOE3                     :1;
        __IO   uint8_t  IOP2                     :1;
        __IO   uint8_t  IOP3                     :1;
} stc_mft_ocsa32_field_t;

typedef struct stc_mft_ocsb32_field
{
        __IO   uint8_t  OTD2                     :1;
        __IO   uint8_t  OTD3                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  BTS2                     :1;
        __IO   uint8_t  BTS3                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_ocsb32_field_t;

typedef struct stc_mft_ocsa54_field
{
        __IO   uint8_t  CST4                     :1;
        __IO   uint8_t  CST5                     :1;
        __IO   uint8_t  BDIS4                    :1;
        __IO   uint8_t  BDIS5                    :1;
        __IO   uint8_t  IOE4                     :1;
        __IO   uint8_t  IOE5                     :1;
        __IO   uint8_t  IOP4                     :1;
        __IO   uint8_t  IOP5                     :1;
} stc_mft_ocsa54_field_t;

typedef struct stc_mft_ocsb54_field
{
        __IO   uint8_t  OTD4                     :1;
        __IO   uint8_t  OTD5                     :1;
        __IO   uint8_t  RESERVED0                :2;
        __IO   uint8_t  CMOD                     :1;
        __IO   uint8_t  BTS4                     :1;
        __IO   uint8_t  BTS5                     :1;
        __IO   uint8_t  RESERVED1                :1;
} stc_mft_ocsb54_field_t;

typedef struct stc_mft_ocsc_field
{
        __IO   uint8_t  MOD0                     :1;
        __IO   uint8_t  MOD1                     :1;
        __IO   uint8_t  MOD2                     :1;
        __IO   uint8_t  MOD3                     :1;
        __IO   uint8_t  MOD4                     :1;
        __IO   uint8_t  MOD5                     :1;
        __IO   uint8_t  RESERVED0                :2;
} stc_mft_ocsc_field_t;

typedef struct stc_mft_tccp0_field
{
    union {
        struct {
            __IO  uint16_t  TCCP                 :16;
        };
        struct {
            __IO  uint16_t  TCCP0                :1;
            __IO  uint16_t  TCCP1                :1;
            __IO  uint16_t  TCCP2                :1;
            __IO  uint16_t  TCCP3                :1;
            __IO  uint16_t  TCCP4                :1;
            __IO  uint16_t  TCCP5                :1;
            __IO  uint16_t  TCCP6                :1;
            __IO  uint16_t  TCCP7                :1;
            __IO  uint16_t  TCCP8                :1;
            __IO  uint16_t  TCCP9                :1;
            __IO  uint16_t  TCCP10               :1;
            __IO  uint16_t  TCCP11               :1;
            __IO  uint16_t  TCCP12               :1;
            __IO  uint16_t  TCCP13               :1;
            __IO  uint16_t  TCCP14               :1;
            __IO  uint16_t  TCCP15               :1;
        };
    };
} stc_mft_tccp0_field_t;

typedef struct stc_mft_tcsa0_field
{
    union {
        struct {
            __IO  uint16_t  CLK                  :4;
            __IO  uint16_t  SCLR                 :1;
            __IO  uint16_t  MODE                 :1;
            __IO  uint16_t  STOP                 :1;
            __IO  uint16_t  BFE                  :1;
            __IO  uint16_t  ICRE                 :1;
            __IO  uint16_t  ICLR                 :1;
            __IO  uint16_t  RESERVED0            :3;
            __IO  uint16_t  IRQZE                :1;
            __IO  uint16_t  IRQZF                :1;
            __IO  uint16_t  ECKE                 :1;
        };
        struct {
            __IO  uint16_t  CLK0                 :1;
            __IO  uint16_t  CLK1                 :1;
            __IO  uint16_t  CLK2                 :1;
            __IO  uint16_t  CLK3                 :1;
            __IO  uint16_t  RESERVED1            :12;
        };
    };
} stc_mft_tcsa0_field_t;

typedef struct stc_mft_tcsb0_field
{
        __IO  uint16_t  AD0E                     :1;
        __IO  uint16_t  AD1E                     :1;
        __IO  uint16_t  AD2E                     :1;
        __IO  uint16_t  RESERVED0                :13;
} stc_mft_tcsb0_field_t;

